IIIIntx/openwsn-fw-52833/projects/nrf52833/multi_tx1/multi_tx1.c
/**
\brief This program is the tx1 for AMUNA
\author Manjiang Cao <mcao999@connect.hkust-gz.edu.cn>, Sept 2025.
*/

#include "stdint.h"
#include "string.h"
#include "board.h"
#include "radio.h"
#include "leds.h"
#include "sctimer.h"
#include "radio_df.h"
#include "aod.h"
#include "uart.h"
#include "timer.h"
#include "nrf52833.h"
#include "nrf52833_bitfields.h"

//=========================== defines =========================================

#define LENGTH_BLE_CRC  3
#define LENGTH_PACKET   125+LENGTH_BLE_CRC  ///< maximum length is 127 bytes
#define CHANNEL         17              ///< 0~39
#define TIMER_PERIOD    (0xffff>>2)     ///< 0xffff = 2s@32kHz

#define NUM_SAMPLES     SAMPLE_MAXCNT
//#define LEN_UART_BUFFER ((NUM_SAMPLES*4)+8)
#define LEN_UART_BUFFER ((NUM_SAMPLES*4)*2+7)
#define LENGTH_SERIAL_FRAME  127            // length of the serial frame

#define ENABLE_DF       1
#define TX_POWER_SETTING RADIO_TXPOWER_TXPOWER_Neg8dBm

uint16_t length = 0;

const static uint8_t ble_device_addr[6] = { 
    0xaa, 0xbb, 0xcc, 0xcc, 0xbb, 0xaa
};

// get from https://openuuid.net/signin/:  a24e7112-a03f-4623-bb56-ae67bd653c73
const static uint8_t ble_uuid[16]       = {
    0xa2, 0x4e, 0x71, 0x12, 0xa0, 0x3f, 
    0x46, 0x23, 0xbb, 0x56, 0xae, 0x67,
    0xbd, 0x65, 0x3c, 0x73
};

#define DEBUG_RADIO_PIN 11

#define SEND_DURATION     (16000000/200)*100    // start-to-start period: 500 ms

//=========================== variables =======================================

enum {
    APP_FLAG_START_FRAME = 0x01,
    APP_FLAG_END_FRAME   = 0x02,
    APP_FLAG_TIMER       = 0x04,
};

typedef enum {
    APP_STATE_TX          = 0x01,
    APP_STATE_RX          = 0x02,
    APP_STATE_OFF         = 0x04,
} app_state_t;

typedef struct {
    uint8_t              num_startFrame;
    uint8_t              num_endFrame;
    uint8_t              num_timer;
} app_dbg_t;

app_dbg_t app_dbg;

 typedef struct {
                 app_state_t     state;
 
                 uint8_t         pkt_sqn;
                 uint32_t        time_slotStartAt;
 
                 uint8_t         packet[LENGTH_PACKET];
                 uint8_t         packet_len;
 
                 uint8_t         tx_now;
 } app_vars_t;
 
 app_vars_t app_vars;

//=========================== prototypes ======================================

void     cb_startFrame(PORT_TIMER_WIDTH timestamp);
void     cb_endFrame(PORT_TIMER_WIDTH timestamp);

void     cb_timer(void);
void     assemble_ibeacon_packet(uint8_t);
void     nrf_gpio_cfg_output(uint8_t port_number, uint32_t pin_number);
//=========================== main ============================================

/**
\brief The program starts executing here.
*/
int mote_main(void) {
    // clear local variables
    memset(&app_vars,0,sizeof(app_vars_t));

    // initialize board
    board_init();
    leds_init();

    radio_rfOff();
    app_vars.state = APP_STATE_OFF;

    nrf_gpio_cfg_output(0, DEBUG_RADIO_PIN);
#if ENABLE_DF == 1
    //antenna_CHW_rx_switch_init();
    // Single-antenna node: no DFE GPIO antenna switching is required.
    // radio_configure_direction_finding_antenna_switch();
    // AoA TX generates the CTE without transmitter-side antenna switching.
    // DFE GPIO switching remains disabled for this single-antenna node.
    radio_configure_direction_finding_manual_AoA();
    //set_antenna_CHW_switches();
#endif

    // add radio callback functions
    radio_setStartFrameCb(cb_startFrame);
    radio_setEndFrameCb(cb_endFrame);
    
    //sctimer_set_callback(0, cb_timer);
    //timer_capture_now(0);
    //app_vars.time_slotStartAt = sctimer_readCounter() + SEND_DURATION;
    //sctimer_setCompare(0, app_vars.time_slotStartAt);

    timer_init();
    timer_start();

    timer_set_callback(0, cb_timer);
    timer_capture_now(0);
    app_vars.time_slotStartAt = timer_getCapturedValue(0) + SEND_DURATION;
    timer_schedule(0, app_vars.time_slotStartAt);

    // prepare radio
    radio_rfOn();
    // TX1 only: override the shared BSP default (0 dBm) with +4 dBm.
    NRF_RADIO->TXPOWER =
        (TX_POWER_SETTING << RADIO_TXPOWER_TXPOWER_Pos);
    // freq type only effects on scum port
    radio_setFrequency(CHANNEL, FREQ_TX);
    app_vars.packet_len = sizeof(app_vars.packet);
    assemble_ibeacon_packet(app_vars.pkt_sqn);
    radio_loadPacket(app_vars.packet, LENGTH_PACKET);

    radio_txEnable();
    app_vars.state = APP_STATE_TX;
    // Keep the LED off while waiting; cb_timer turns it on for the TX pulse.
    leds_radio_off();



    while(1) {
        board_sleep();
    }
}

//=========================== private =========================================

void assemble_ibeacon_packet(uint8_t sqn) {

     uint8_t i;
     i=0;

     memset( app_vars.packet, 0x00, sizeof(app_vars.packet) );

     app_vars.packet[i++]  = 0x42;               // BLE ADV_NONCONN_IND (this is a must)
     app_vars.packet[i++]  = 0x21;               // Payload length
     app_vars.packet[i++]  = ble_device_addr[0]; // BLE adv address byte 0
     app_vars.packet[i++]  = ble_device_addr[1]; // BLE adv address byte 1
     app_vars.packet[i++]  = ble_device_addr[2]; // BLE adv address byte 2
     app_vars.packet[i++]  = ble_device_addr[3]; // BLE adv address byte 3
     app_vars.packet[i++]  = ble_device_addr[4]; // BLE adv address byte 4
     app_vars.packet[i++]  = ble_device_addr[5]; // BLE adv address byte 5

     app_vars.packet[i++]  = 0x1a;
     app_vars.packet[i++]  = 0xff;
     app_vars.packet[i++]  = 0x4c;
     app_vars.packet[i++]  = 0x00;

     app_vars.packet[i++]  = 0x02;
     app_vars.packet[i++]  = 0x15;
     memcpy(&app_vars.packet[i], &ble_uuid[0], 16);
     i                    += 16;
     app_vars.packet[i++]  = 0x00;               // major
     app_vars.packet[i++]  = 0xff;
     app_vars.packet[i++]  = 0x00;               // minor
     app_vars.packet[i++]  = sqn;                // 34 byte
     app_vars.packet[i++]  = 0x01;               // tx id
}
//=========================== callbacks =======================================

void cb_startFrame(PORT_TIMER_WIDTH timestamp) {
    // set flag
    //app_vars.flags |= APP_FLAG_START_FRAME;

    //leds_sync_on();
    // update debug stats
    app_dbg.num_startFrame++;
}

void cb_endFrame(PORT_TIMER_WIDTH timestamp) {
    app_dbg.num_endFrame++;

    if (app_vars.state == APP_STATE_TX) {
        // Advance from the previous scheduled TX start, not from PHYEND, so
        // packet/CTE duration does not stretch the 500 ms period.
        app_vars.time_slotStartAt += SEND_DURATION;
        timer_schedule(0, app_vars.time_slotStartAt);
        app_vars.pkt_sqn++;
        assemble_ibeacon_packet(app_vars.pkt_sqn);
        radio_loadPacket(app_vars.packet, LENGTH_PACKET);

        radio_txEnable();
        app_vars.state = APP_STATE_TX;
        // Keep the indicator off while waiting for the next TX event.
        leds_radio_off();
    }
}

void cb_timer(void) {
    leds_error_toggle();
    app_dbg.num_timer++;
    // Toggle once when this packet starts transmitting.
    leds_radio_toggle();
    radio_txNow();
}
